In [1]:
import pandas as pd

In [5]:
dataFrame=pd.read_excel("maas.xlsx")

In [7]:
dataFrame

  Unnamed: 0  Maas   Yas  Departman
0       Atıl   100  40.0    Yazılım
1     Zeynep   150  50.0      Satış
2     Mehmet   200  30.0        NaN
3      Ahmet    50  10.0  Pazarlama
4      Atlas   150   NaN     Finans
5      Fatma   200  25.0      Hukuk

In [11]:
doluDegerlerFrame=dataFrame.dropna()

In [13]:
doluDegerlerFrame

  Unnamed: 0  Maas   Yas  Departman
0       Atıl   100  40.0    Yazılım
1     Zeynep   150  50.0      Satış
3      Ahmet    50  10.0  Pazarlama
5      Fatma   200  25.0      Hukuk

In [15]:
dataFrame

  Unnamed: 0  Maas   Yas  Departman
0       Atıl   100  40.0    Yazılım
1     Zeynep   150  50.0      Satış
2     Mehmet   200  30.0        NaN
3      Ahmet    50  10.0  Pazarlama
4      Atlas   150   NaN     Finans
5      Fatma   200  25.0      Hukuk

In [17]:
doluDegerlerFrame.to_excel("yenimaas.xlsx")